Функция ОперацииШаблон() Экспорт
	
	ОперацииБД = Новый Соответствие;
	ОперацииБД.Вставить("Выбрать", "SELECT %ИменаКолонок% FROM %ИмяБД%.%ИмяТаблицы% %ФорматДанных%");
	ОперацииБД.Вставить("Вставить", "INSERT  INTO %ИмяБД%.%ИмяТаблицы% VALUES(%ЗначенияВставки%");
	ОперацииБД.Вставить("Создать таблицу", "CREATE TABLE %ИмяБД%.%ИмяТаблицы% (%КолонкиТипыТаблицы%)");
	ОперацииБД.Вставить("Создать Базу Данных", "CREATE DATABASE %ИмяБД% %ТипБазы%");
	
	Возврат ОперацииБД;
	
КонецФункции

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытий
// Код процедур и функций
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти

#Область Инициализация

#КонецОбласти