
#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс
Функция ШаблоныОпераций() Экспорт
	
	ОперацииБД = Новый Соответствие;
	ОперацииБД.Вставить("Выборка данных", "SELECT %ИменаКолонок% FROM %ИмяБД%.%ИмяТаблицы% %ФорматДанных%");
	ОперацииБД.Вставить("Вставка данных", "INSERT  INTO %ИмяБД%.%ИмяТаблицы% VALUES(%ЗначенияВставки%");
	ОперацииБД.Вставить("Создать таблицу", "CREATE TABLE %ИмяБД%.%ИмяТаблицы% (%КолонкиТипыТаблицы%)");
	ОперацииБД.Вставить("Создать Базу Данных", "CREATE DATABASE %ИмяБД% %ТипБазы%");
	
	Возврат ОперацииБД;
	
КонецФункции

Функция РеализованныеОперации() Экспорт
	
	Операции_CH = Новый Массив;
	
	Для каждого Операция из ШаблоныОпераций() Цикл
		Операции_CH.Добавить(Операция.Ключ);
	КонецЦикла;
	
	Возврат Операции_CH;
	
КонецФункции

Функция Запрос_CH(ПараметрыПодключения, ТекстЗапроса, ТипЗапроса) Экспорт
	
	HTTPСоеднинениеCH = ИнициализироватьHTTPСоединение(ПараметрыПодключения);
	ОтветПоЗапросу = Новый Структура("КодОтвета, ТелоОтвета", 400, "");
	
	Если ТипЗапроса = "get" Тогда
		ОтветПоЗапросу = getЗапрос(HTTPСоеднинениеCH, ТекстЗапроса);
	ИначеЕсли ТипЗапроса = "post" Тогда
		ОтветПоЗапросу = postЗапрос(HTTPСоеднинениеCH, ТекстЗапроса);
	Иначе
		ВызватьИсключение "Вызван неизвестный тип запроса";
	КонецЕсли;
	
	Возврат ОтветПоЗапросу;
	
КонецФункции

#Область СправочнаяИнформацияПодсказки
Функция ВстроенныеТипыClickHouse() Экспорт
	
КонецФункции
#КонецОбласти

Функция ЗапросСписокВсехБД(ПараметрыПодключения) Экспорт
	
	ТекстЗапроса = "SHOW DATABASES Format JSON";
//	ТекстЗапроса = "SHOW DATABASES";
//	ТекстЗапроса = "SELECT now()";
	РезультатЗапроса = Запрос_CH(ПараметрыПодключения, ТекстЗапроса, "post");
	
	Если РезультатЗапроса.КодСостояния = 200 Тогда
		Возврат РезультатЗапроса.ПолучитьТелоКакСтроку();
	КонецЕсли;
	
	Сообщить("Ошибка Код "+РезультатЗапроса.КодСостояния);
	Возврат РезультатЗапроса.ПолучитьТелоКакСтроку();
	
КонецФункции
#КонецОбласти

#Область ОбработчикиСобытий
// Код процедур и функций
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Функция ИнициализироватьHTTPСоединение(ПараметрыПодключения)
	
	АдресСервера = "";
	Порт = "";
	Логин = "";
	Пароль = "";
	
	ПараметрыПодключения.Свойство("АдресСервера", АдресСервера);
	ПараметрыПодключения.Свойство("Порт", Порт);
	ПараметрыПодключения.Свойство("Логин", Логин);
//	ПараметрыПодключения.Свойство("Пароль", Пароль);
	Возврат Новый HTTPСоединение(АдресСервера, Порт,Логин);
	
КонецФункции

Функция getЗапрос(HTTPСоединениеClickHouse, ТекстЗапроса) 
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("X-ClickHouse-User", "user1");
	Заголовки.Вставить("X-ClickHouse-Key", "<password>");
	
	HTTPЗапросВнБД = Новый HTTPЗапрос("?query=" + ТекстЗапроса, Заголовки);
	HTTPОтветВнБД = HTTPСоединениеClickHouse.Получить(HTTPЗапросВнБД);
	
	Возврат HTTPОтветВнБД;	
	
КонецФункции

Функция postЗапрос(ПодключениеClickHouse, ТекстЗапроса) 
										   
	ИмяВремФайла = ПолучитьИмяВременногоФайла();
	ФайлЗапрос = Новый ТекстовыйДокумент();
	ФайлЗапрос.УстановитьТекст(ТекстЗапроса);
	ФайлЗапрос.Записать(ИмяВремФайла, КодировкаТекста.UTF8);
	
	HTTPЗапросВнБД = Новый HTTPЗапрос();
	HTTPЗапросВнБД.УстановитьИмяФайлаТела(ИмяВремФайла);
	
	HTTPОтветВнБД = ПодключениеClickHouse.ОтправитьДляОбработки(HTTPЗапросВнБД);
	
	Возврат HTTPОтветВнБД;
	
КонецФункции

#КонецОбласти

#Область Инициализация

#КонецОбласти