#Область ОписаниеПеременных
Перем ТипДвижкаБДПоУмолчанию;

&НаКлиенте
Перем Движки;
#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
		ТипДвижкаБазыДанных = ТипДвижкаБДПоУмолчанию;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//ДоступныеДвижкиБД = ОбработкаОбъект.ДвижкиБазДанных();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ТипБазыДанныхПриИзменении(Элемент)
	
	ПараметрыДвижка = ДоступныеДвижкиБД[ТипДвижкаБазыДанных];
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СгенерироватьЗапрос(Команда)
	
	СтруктураЗапроса = Новый Структура;
	СтруктураЗапроса.Вставить("IF_NOT_EXISTS", ?(IF_NOT_EXISTS, "IF NOT EXISTS", ""));
	СтруктураЗапроса.Вставить("dbName", ИмяБазыДанных);
	СтруктураЗапроса.Вставить("ON_CLUSTER", ClusterName);
	
	Если Не ПустаяСтрока(СокрЛП(ПараметрыДвижка)) Тогда
		СтруктураЗапроса.Вставить("ENGINEоб", СтрШаблон("%1(%2)",ТипДвижкаБазыДанных, ПараметрыДвижка));
	Иначе	
		СтруктураЗапроса.Вставить("ENGINEоб", ТипДвижкаБазыДанных);
	КонецЕсли;
	
	Оповестить("Новый текст запроса", СтруктураЗапроса);
	Закрыть();
	
КонецПроцедуры
#КонецОбласти

ТипДвижкаБДПоУмолчанию = "Atomic";