
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("bdName", dbName);
	Параметры.Свойство("ПараметрыПодключения", ПараметрыПодключения);
	Элементы.СоставТаблицыТипКолонки.СписокВыбора.ЗагрузитьЗначения(
							РеквизитФормыВЗначение("Объект")
							.ТипыДанныхСтолбцов()); 
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

//#Область ОбработчикиСобытийЭлементовТаблицыФормы<ИмяТаблицыФормы>
//// Код процедур и функций
//#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СписокДвижковТаблиц(Команда)
	СписокДвижковТаблицНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СгенерироватьЗапрос(Команда)
	СгенерироватьЗапросНаСервере();
	
	СтруктураЗапроса = Новый Структура;
	СтруктураЗапроса.Вставить("dbName", dbName);
	СтруктураЗапроса.Вставить("table_Name", table_Name);
	СтруктураЗапроса.Вставить("COLUMS", "");
	
	
	Оповестить("Секции запроса выборки", СтруктураЗапроса, "Создать таблицу");
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СписокДвижковТаблицНаСервере()
	 Элементы.ENGINE.СписокВыбора.ЗагрузитьЗначения(РеквизитФормыВЗначение("Объект").ДвижкиТаблиц(ПараметрыПодключения));
КонецПроцедуры

&НаСервере
Процедура СгенерироватьЗапросНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

#КонецОбласти